#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

module.network.volcengine_subnet.subnet: Refreshing state... [id=subnet-13f1z238jocu83n6nu5nxs3gh]
module.network.volcengine_vpc.vpc: Refreshing state... [id=vpc-13f1yrehipnnk3n6nu5hrtaxi]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.network.volcengine_subnet.subnet will be destroyed
  # (because volcengine_subnet.subnet is not in configuration)
  - resource "volcengine_subnet" "subnet" {
      - cidr_block    = "10.4.0.0/24" -> null
      - creation_time = "2025-01-09T00:00:26+08:00" -> null
      - enable_ipv6   = false -> null
      - id            = "subnet-13f1z238jocu83n6nu5nxs3gh" -> null
      - status        = "Available" -> null
      - subnet_name   = "tf-test-subnet-dev-new" -> null
      - vpc_id        = "vpc-13f1yrehipnnk3n6nu5hrtaxi" -> null
      - zone_id       = "cn-beijing-a" -> null
        # (1 unchanged attribute hidden)
    }

  # module.network.volcengine_vpc.vpc will be destroyed
  # (because volcengine_vpc.vpc is not in configuration)
  - resource "volcengine_vpc" "vpc" {
      - account_id            = "2100049427" -> null
      - associate_cens        = [] -> null
      - auxiliary_cidr_blocks = [] -> null
      - cidr_block            = "10.4.0.0/16" -> null
      - creation_time         = "2025-01-09T00:00:21+08:00" -> null
      - dns_servers           = [] -> null
      - enable_ipv6           = false -> null
      - id                    = "vpc-13f1yrehipnnk3n6nu5hrtaxi" -> null
      - nat_gateway_ids       = [] -> null
      - project_name          = "default" -> null
      - route_table_ids       = [
          - "vtb-13f1yrggjtpmo3n6nu545b4xp",
        ] -> null
      - security_group_ids    = [
          - "sg-13f1yrkem1tkw3n6nu5agvjh2",
        ] -> null
      - status                = "Available" -> null
      - subnet_ids            = [
          - "subnet-13f1z238jocu83n6nu5nxs3gh",
        ] -> null
      - update_time           = "2025-01-09T00:43:17+08:00" -> null
      - vpc_id                = "vpc-13f1yrehipnnk3n6nu5hrtaxi" -> null
      - vpc_name              = "tf-test-vpc-dev-new" -> null
        # (2 unchanged attributes hidden)
    }

  # module.network-1.volcengine_subnet.subnet will be created
  + resource "volcengine_subnet" "subnet" {
      + cidr_block      = "10.4.0.0/24"
      + creation_time   = (known after apply)
      + enable_ipv6     = (known after apply)
      + id              = (known after apply)
      + ipv6_cidr_block = (known after apply)
      + status          = (known after apply)
      + subnet_name     = "tf-test-subnet-dev-demo"
      + vpc_id          = (known after apply)
      + zone_id         = "cn-beijing-a"
    }

  # module.network-1.volcengine_vpc.vpc will be created
  + resource "volcengine_vpc" "vpc" {
      + account_id            = (known after apply)
      + associate_cens        = (known after apply)
      + auxiliary_cidr_blocks = (known after apply)
      + cidr_block            = "10.4.0.0/16"
      + creation_time         = (known after apply)
      + enable_ipv6           = (known after apply)
      + id                    = (known after apply)
      + ipv6_cidr_block       = (known after apply)
      + nat_gateway_ids       = (known after apply)
      + project_name          = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + status                = (known after apply)
      + subnet_ids            = (known after apply)
      + update_time           = (known after apply)
      + vpc_id                = (known after apply)
      + vpc_name              = "tf-test-vpc-dev-demo-1"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @msq177, Action: `pull_request`*